Repository: MarcusBecker6123/stundenrechner
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Working Hours
hi: कार्य समय

# greeting
source: Hello!
hi: नमस्ते!

source: Export
hi: निर्यात करें

source: Delete
hi: हटाएं

source: Edit
hi: संपादित करें

source: Hours
hi: घंटे

# confirm
source: Confirm Deletion
hi: हटाने की पुष्टि करें

# navbar1
source: Calculator
hi: कैलकुलेटर

# navbar2
source: Working Hours
hi: कार्य समय

# calculator
source: Hours Calculator
hi: घंटा कैलकुलेटर

# noDate
source: No date selected
hi: कोई तिथि चयनित नहीं

source: Date
hi: तिथि

source: Choose Date
hi: तिथि चुनें

# begin
source: Start
hi: प्रारंभ

source: End
hi: समाप्त

# format24Hour
source: 24-Hour Format
hi: 24-घंटे प्रारूप

# alert
source: Hint
hi: सूचना

source: Error
hi: त्रुटि

# eHandler
source: Start must be before end and break time cannot be negative.
hi: प्रारंभ अंत से पहले होना चाहिए और ब्रेक समय नकारात्मक नहीं हो सकता।

# hourdiff
source: Hour Difference
hi: घंटों का अंतर

# insert
source: Enter
hi: जोड़ें

# cconfirm
source: Confirm
hi: पुष्टि करें

# question
source: Are you sure you want to delete this entry?
hi: क्या आप वाकई इस प्रविष्टि को हटाना चाहते हैं?

# noData
source: No data available
hi: निर्यात करने के लिए कोई डेटा नहीं।

# exportAll
source: all_working_hours_export
hi: kaaryasamay_niryaat_sabhi

# exportSelected
source: hours_export_
hi: kaaryasamay_niryaat_

# noSupported
source: Platform not supported.
hi: प्लेटफ़ॉर्म समर्थित नहीं है।

# exportError
source: Export failed
hi: डेटा निर्यात करने में त्रुटि।

# chooseExport
source: What would you like to export?
hi: आप क्या निर्यात करना चाहते हैं?

source: Month
hi: केवल चयनित माह

# all
source: All Data
hi: सभी डेटा

source: Year
hi: पूरा वर्ष

source: Sum for
hi: के लिए योग

source: Monthly Hours
hi: मासिक घंटे

# details
source: Details for
hi: विवरण

# fur
source: for
hi: के लिए

# breakTime
source: Break (e.g., 0.5 for 30 minutes)
hi: ब्रेक समय

source: Save
hi: सहेजें

source: Cancel
hi: रद्द करें
